ERP.belugaerp/src/Catalogs/СкидкиНаценки/СкидкиНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СкидкиНаценки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КорневаяГруппа</name>
    </items>
  </predefined>
  <attributes>
    <name>бг_Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Акционная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_БезусловноеПрименениеПослеПервогоСрабатывания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_БлокируетСуммовыеСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИсточникЦеновойГруппы</name>
    <type>
      <types>EnumRef.бг_ИсточникиЦеновойГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КаналыПродаж</name>
    <type>
      <types>CatalogRef.битКаналыПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодСтрокиБюджета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Накопительная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НеУчитыватьПороги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОграничениеСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипСкидкиНаценкиCRM</name>
    <type>
      <types>CatalogRef.бг_ТипыСкидокНаценокCRM</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТребуетсяПодтверждениеМТ</name>
    <comment>МТ - мобильная торговля</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ШаблонСкидкиЧКН</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>бг_ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
        <types>CatalogRef.бг_ЕК_СКЮ_СкюМТ</types>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыТМ</types>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыМТ</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.бг_ЕК_СКЮ_Вкусы</types>
        <types>CatalogRef.бг_ЕК_СКЮ_Классы</types>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бренд_МТ</name>
      <type>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыМТ</types>
      </type>
    </attributes>
    <attributes>
      <name>Вкус</name>
      <type>
        <types>CatalogRef.бг_ЕК_СКЮ_Вкусы</types>
      </type>
    </attributes>
    <attributes>
      <name>СкюМТ</name>
      <type>
        <types>CatalogRef.бг_ЕК_СКЮ_СкюМТ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_Исключения</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
        <types>CatalogRef.битКаналыПродаж</types>
        <types>CatalogRef.битТерриторииПунктовНазначения</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.СегментыПартнеров</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_Ограничения</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоСуммеСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоОбъему</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоСуммеСкидкиНаПунктНазначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоОбъемуНаПунктНазначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Enums/бг_ИсточникиЦеновойГруппы/бг_ИсточникиЦеновойГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ИсточникиЦеновойГруппы</name>
  <enumValues>
    <name>SKU_MT</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>BrandMT</name>
  </enumValues>
  <enumValues>
    <name>BrandTM</name>
  </enumValues>
  <enumValues>
    <name>Вкус</name>
  </enumValues>
  <enumValues>
    <name>Класс</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>ЦеноваяГруппа</name>
  </enumValues>
  <enumValues>
    <name>Смешанный</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/СкидкиНаценки/Forms/бг_УточнениеСкидкиНаценки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
	УточненияЗначенияСкидкиНаценки.Загрузить(ТаблицаЗначений);
	ТолькоПросмотрЭлементов = Параметры.ТолькоПросмотр ИЛИ Не ПравоДоступа("Изменение", Метаданные.Справочники.СкидкиНаценки);
	Элементы.УточненияЗначенияСкидкиНаценки.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	Элементы.ФормаЗавершитьРедактирование.Доступность = Не ТолькоПросмотрЭлементов;
	Элементы.ИсточникГруппы.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	ИсточникГруппы = Параметры.ИсточникГруппы;
	Если НЕ ЗначениеЗаполнено(ИсточникГруппы) Тогда
		ИсточникГруппы = Перечисления.бг_ИсточникиЦеновойГруппы[0];
	КонецЕсли;
	УстановитьОграничениеТипа();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	Для Каждого СтрокаТЧ Из УточненияЗначенияСкидкиНаценки Цикл
		НомерСтроки = УточненияЗначенияСкидкиНаценки.Индекс(СтрокаТЧ) + 1;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ЦеноваяГруппа) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнена колонка ""Ценовая группа"" в строке %1 списка ""Уточнения значения скидки (наценки)""';
					|en = 'Column ""Price group"" in line %1 of list ""Discount (markup) value specifications"" is not filled in'"), НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("УточненияЗначенияСкидкиНаценки", НомерСтроки, "СпособДоставки"),, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("ИсточникГруппы",            ИсточникГруппы);
	Данные.Вставить("АдресВоВременномХранилище", АдресТабличнойЧастиУточненияПоЦеновымГруппамВоВременномХранилище());
	
	Закрыть(Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТабличногоДокумента(Команда)
	
	Если ИсточникГруппы = ПредопределенноеЗначение("Перечисление.бг_ИсточникиЦеновойГруппы.Смешанный") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для данного типа источника загрузка не предусмотрена'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "СкидкиНаценки.бг_ЦеновыеГруппы";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка уточнений из файла';
										|en = 'Import Item list from file'");

	ПараметрыЗагрузки.ДополнительныеПараметры =  Новый Структура;
	ПараметрыЗагрузки.ДополнительныеПараметры.Вставить("ИсточникГруппы", ИсточникГруппы);
	
	ПараметрыЗагрузки.КолонкиМакета = ОписаниеКолонокМакетаДляЗагрузки();

	Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИсточникГруппыПриИзменении(Элемент)
	
	УстановитьОграничениеТипа();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникГруппыОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АдресТабличнойЧастиУточненияПоЦеновымГруппамВоВременномХранилище()

	Возврат ПоместитьВоВременноеХранилище(УточненияЗначенияСкидкиНаценки.Выгрузить(), УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура УстановитьОграничениеТипа()
	
	НастройкаПоля = Перечисления.бг_ИсточникиЦеновойГруппы.НастройкиПолейЗапроса()[ИсточникГруппы];
	
	КолонкаТабличногоПоля = Элементы.УточненияЗначенияСкидкиНаценкиЦеноваяГруппа;
	КолонкаТабличногоПоля.ДоступныеТипы   = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НастройкаПоля.Тип));
	КолонкаТабличногоПоля.ОграничениеТипа = КолонкаТабличногоПоля.ДоступныеТипы;
	Если ИсточникГруппы = Перечисления.бг_ИсточникиЦеновойГруппы.Смешанный Тогда
		КолонкаТабличногоПоля.Заголовок       = "Бренд ТМ";
	Иначе
		КолонкаТабличногоПоля.Заголовок       = Строка(ИсточникГруппы);
	КонецЕсли;
	
	РеквизитыСмешанногоТипа = Новый Структура("Бренд_МТ, Вкус, СкюМТ");
	Для каждого Реквизит Из РеквизитыСмешанногоТипа Цикл
		Элементы["УточненияЗначенияСкидкиНаценки" + Реквизит.Ключ].Видимость = ИсточникГруппы = Перечисления.бг_ИсточникиЦеновойГруппы.Смешанный;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеКолонокМакетаДляЗагрузки();
	
	КолонкиМакета = Новый Массив;
	
	Для каждого ЭлементКолонка Из Элементы.УточненияЗначенияСкидкиНаценки.ПодчиненныеЭлементы Цикл
		Если ЭлементКолонка.Видимость Тогда
			
			Если ЭлементКолонка.Имя	= "УточненияЗначенияСкидкиНаценкиЗначениеСкидкиНаценки" Тогда
				ОписаниеТипа = Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15, 4));
				ШиринаКолонки = 15;
			Иначе
				ОписаниеТипа = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200));
				ШиринаКолонки = 100;
			КонецЕсли;
			
			ИмяКолонки = СтрЗаменить(ЭлементКолонка.Имя, ЭлементКолонка.Родитель.Имя, "");
			
			Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета(ИмяКолонки, 
				ОписаниеТипа, 
				ЗаголовокПоляФормы(ЭлементКолонка), ШиринаКолонки);
			
			Колонка.Позиция = КолонкиМакета.Количество();
			КолонкиМакета.Добавить(Колонка);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат КолонкиМакета;
	
КонецФункции

&НаКлиенте
Функция ЗаголовокПоляФормы(ПолеФормы);

	Если ЗначениеЗаполнено(ПолеФормы.Заголовок) Тогда
		Возврат ПолеФормы.Заголовок;
	Иначе
		Возврат ЗаголовокРеквизита(ПолеФормы.Имя, ПолеФормы.Родитель.Имя);
	КонецЕсли;

КонецФункции

&НаСервере
Функция ЗаголовокРеквизита(ИмяРеквизита, ПутьКРеквизитам = "");

	МассивРеквизитов = ПолучитьРеквизиты(ПутьКРеквизитам);
	Для каждого Реквизит Из МассивРеквизитов Цикл
		Если ПутьКРеквизитам + Реквизит.Имя = ИмяРеквизита Тогда
			Возврат Реквизит.Заголовок;
		КонецЕсли;
	КонецЦикла;
	Возврат "";

КонецФункции
	
&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеИзФайлаНаСервере(АдресЗагруженныхДанных, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзФайлаНаСервере(АдресЗагруженныхДанных, ДополнительныеПараметры)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	Для Каждого Строка Из ЗагруженныеДанные Цикл
		СтрокаТЧ = УточненияЗначенияСкидкиНаценки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Строка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
